// Напишите программу, которая на вход принимает трехзначное число и на выходе показывает последнюю цифру этого числа.
// Console.WriteLine("Введите трехзначное число");
// string N = Console.ReadLine();
// if (N.Length == 3)
// {
//     Console.WriteLine($"Последний элемент = {N[2]}");
// }
// else Console.WriteLine ("Число не трехзначное");
// Этот метод с недочетом, так как можно ввести любые три символа, не являющихся числом, и программа выдаст последний символ, даже если будет пробел!
Console.WriteLine("Введите трехзначное число");
int num = Convert.ToInt32(Console.ReadLine());
if (num < 0)
{
    num = -num;
}

if (num > 99 && num < 1000)
{
    Console.WriteLine($"Последняя цифра числа: {num % 10}");
}
else 
{
    Console.WriteLine("Не корректное число");
}